//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DElementIndication.cs
*		Определение структур данных и общих типов для элементов индикации интерфейса пользователя.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Позиция области значения индикатор прогресса
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TProgressBarValueLocation
		{
			/// <summary>
			/// По центру индикатора
			/// </summary>
			Center,

			/// <summary>
			/// Справа от индикатора
			/// </summary>
			Right,

			/// <summary>
			/// Слева от индикатора
			/// </summary>
			Left,

			/// <summary>
			/// Сверху индикатора
			/// </summary>
			Top,

			/// <summary>
			/// Снизу индикатора
			/// </summary>
			Bottom
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================