//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DElementBase.cs
*		Определение структур данных и общих типов для базовых элементов пользовательского интерфейса.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Позиция области значения
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TValueLocation
		{
			/// <summary>
			/// Справа от надписи
			/// </summary>
			Right,

			/// <summary>
			/// Слева от надписи
			/// </summary>
			Left,

			/// <summary>
			/// Сверху надписи
			/// </summary>
			Top,

			/// <summary>
			/// Снизу надписи
			/// </summary>
			Bottom
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Тип значения в логической концепции представления данных
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TPresentDataType
		{
			/// <summary>
			/// Числовой тип значения
			/// </summary>
			Number,

			/// <summary>
			/// Текстовый тип значения
			/// </summary>
			Text,

			/// <summary>
			/// Значение в виде индекса массива
			/// </summary>
			Index
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим подстройки размеров текста под содержимое
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TAutoSizeTextMode
		{
			/// <summary>
			/// Нет
			/// </summary>
			None,

			/// <summary>
			/// Обеспечивается минимальное пространство
			/// </summary>
			Minimal,

			/// <summary>
			/// Оптимальный размер под содержимое
			/// </summary>
			Optimal
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================