//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DElementHeader.cs
*		Определение структур данных и общих типов для элементов интерфейса пользователя с отдельной заголовочной областью.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Позиция заголовочной области
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum THeaderLocation
		{
			/// <summary>
			/// Полностью по левой стороне
			/// </summary>
			LeftSide,

			/// <summary>
			/// Полностью сверху
			/// </summary>
			TopSide,

			/// <summary>
			/// Полностью по правой стороне
			/// </summary>
			RightSide,

			/// <summary>
			/// Полностью снизу
			/// </summary>
			BottomSide,

			/// <summary>
			/// Левый верхний угол
			/// </summary>
			LeftTop,

			/// <summary>
			/// Правый верхний угол
			/// </summary>
			RightTop,

			/// <summary>
			/// Левый нижний угол
			/// </summary>
			LeftBottom,

			/// <summary>
			/// Правый нижний угол
			/// </summary>
			RightBottom
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для реализации общей концепции заголовочного элемента
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusHeaderElement
		{
			#region ======================================= СВОЙСТВА ==================================================
			//
			// ОСНОВНЫЕ ПАРАМЕТРЫ
			//
			/// <summary>
			/// Текст заголовка
			/// </summary>
			String HeaderText { get; set; }

			/// <summary>
			/// Текстура иконки заголовка
			/// </summary>
			Texture2D HeaderIcon { get; set; }

			/// <summary>
			/// Имя стиля для рисования заголовка элемента
			/// </summary>
			String StyleHeaderName { get; set; }

			//
			// ПАРАМЕТРЫ РАЗМЕЩЕНИЯ
			//
			/// <summary>
			/// Размер заголовочной области
			/// </summary>
			Single HeaderSize { get; set; }

			/// <summary>
			/// Позиция размещения заголовочной области
			/// </summary>
			THeaderLocation HeaderLocation { get; set; }
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================