//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль IMGUI Unity
// Подраздел: Компоненты IMGUI Unity
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGUIPanelEditor.cs
*		Редактор компонента представляющего панель для размещения элементов модуля IMGUI Unity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using UnityEditor;
using UnityEngine;
using UnityEngine.UI;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Graphics2D;
//=====================================================================================================================
//---------------------------------------------------------------------------------------------------------------------
/// <summary>
/// Редактор компонента представляющего панель для размещения элементов модуля IMGUI Unity
/// </summary>
//---------------------------------------------------------------------------------------------------------------------
[CustomEditor(typeof(LotusGUIPanel))]
public class LotusGUIPanelEditor : LotusGUILabelEditor
{
	#region =============================================== СТАТИЧЕСКИЕ МЕТОДЫ ========================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Создание элемента Panel
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	[MenuItem(XGUIEditorSettings.MenuPathComponent + "Create Panel", false, XGUIEditorSettings.MenuOrderComponent + 4)]
	public static void CreatePanel()
	{
		LotusGUIPanel.CreateElement();
	}
	#endregion

	#region =============================================== ДАННЫЕ ====================================================
	private LotusGUIPanel mPanel;
	#endregion

	#region =============================================== СОБЫТИЯ UNITY =============================================
	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Включение скрипта в инспекторе объектов
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public new void OnEnable()
	{
		mPanel = this.target as LotusGUIPanel;
	}

	//-----------------------------------------------------------------------------------------------------------------
	/// <summary>
	/// Рисование в инспекторе объектов
	/// </summary>
	//-----------------------------------------------------------------------------------------------------------------
	public override void OnInspectorGUI()
	{
		// Рисование свойств основного элемента
		DrawElementParamemtrs(mPanel);

		// Рисование свойств надписи
		DrawLabelParamemtrs(mPanel);

		GUILayout.Space(2.0f);
	}
	#endregion
}
//=====================================================================================================================