//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема геометрических примитивов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DPrimitiveBase.cs
*		Определение данных для отображения геометрических двухмерных примитивов.
*		Определение основных типов данных для отображения каркасных и заполненных геометрических двухмерных примитивов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Reflection;
using System.Collections.Generic;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup Unity2DCommonPrimitive Подсистема геометрических примитивов
		//! Подсистема геометрических двухмерных примитивов определяет общие структуры данных и интерфейсы для 
		//! отображения геометрических примитивов
		//! \ingroup Unity2DCommon
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим соединения углов у примитивов
		/// </summary>
		/// <remarks>
		/// Данный режим применяется для обработки соединения широких линий
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCornerMode
		{
			/// <summary>
			/// Нет сопряжения
			/// </summary>
			None = 0,

			/// <summary>
			/// Острое соединение
			/// </summary>
			/// <remarks>
			/// Края линий дотягиваются до точки пересечения
			/// Плохо смотрится при острых углах
			/// </remarks>
			SharpJoint = 1,

			/// <summary>
			/// Скос на соединение
			/// </summary>
			/// <remarks>
			/// Точка соединения обрабатывается путем дополнения скоса
			/// Метод добавляет данные в геометрию
			/// </remarks>
			Bevel = 2
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================