//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DSettings.cs
*		Настройки общего модуля 2D графики применительно к режиму разработки и редактору Unity
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//---------------------------------------------------------------------------------------------------------------------
// Обеспечивает дружественность для сборки редакторов
[assembly: InternalsVisibleToAttribute("Assembly-CSharp-Editor")]
[assembly: InternalsVisibleToAttribute("Lotus.Unity.Graphics2D.Editor")]
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommon
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения настроек общего модуля 2D графики применительно к режиму разработки и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XGraphics2DEditorSettings
		{
			/// <summary>
			/// Относительный путь директории исходного кода общего модуля 2D
			/// </summary>
			public const String SourcePath = XEditorSettings.SourceGraphics2DPath + "Common/";

			/// <summary>
			/// Путь в размещении меню редактора общего модуля 2D (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Graphics2D/Common/";

			//
			// ИГРОВЫЕ ЭКРАНЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора подсистемы игровых экранов общего модуля 2D (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderScreenGame = XEditorSettings.MenuOrderGraphics2D + 50;

			/// <summary>
			/// Путь в размещении меню редактора игровых экранов общего модуля 2D (для упорядочивания)
			/// </summary>
			public const String MenuPathScreenGame = MenuPath + "ScreenGame/";

			//
			// ПОСЛЕДНИЕ ПУНКТЫ МЕНЮ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора общего модуля 2D (для упорядочивания в конце)
			/// </summary>
			public const Int32 MenuOrderLast = XEditorSettings.MenuOrderGraphics2D + 100;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================