//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DElement.cs
*		Определение базовых интерфейсов для 2D элементов.
*		Определения базовых интерфейсов для 2D элементов, которые определяют различные функциональные возможности элемента,
*	его местоположение и размеры, интерактивности, визуальный эффектов, установки данных и т.д.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для общего абстрактного элемента пользовательского интерфейса пользователя
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusBaseElement : ILotusBasePlaceable2D, ILotusVisualStyle, 
			ILotusVisibility, IComparable<ILotusBaseElement>
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Имя элемента
			/// </summary>
			/// <remarks>
			/// Должно быть уникально в пределах проекта
			/// </remarks>
			String Name { get; set; }

			/// <summary>
			/// Тэг для определения пользовательских данных
			/// </summary>
			Int32 UserTag { get; set; }

			/// <summary>
			/// Статус обновления элемента
			/// </summary>
			Boolean IsDirty { get; set; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Переустановка/обновление параметров элемента
			/// </summary>
			/// <remarks>
			/// Вызывается центральным диспетчером в момент добавления(регистрации) элемента (метод Awake)
			/// </remarks>
			//---------------------------------------------------------------------------------------------------------
			void OnReset();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обновление элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void OnUpdate();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Рисование элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void OnDraw();
			#endregion
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для базового элемента пользовательского интерфейса пользователя
		/// </summary>
		/// <remarks>
		/// Это общая концепция интерфейса элемента для адаптивного размещения на экране и поддержке иерархических отношений
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusElement : ILotusBaseElement, ILotusPlaceable2D, ILotusEnabling
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Родительский элемент
			/// </summary>
			ILotusElement IParent { get; }

			/// <summary>
			/// Ширина (размер по X) родительского элемента
			/// </summary>
			Single ParentWidth { get; }

			/// <summary>
			/// Актуальная ширина (размер по X) родительского элемента
			/// </summary>
			Single ParentWidthScreen { get; }

			/// <summary>
			/// Высота (размер по Y) родительского элемента
			/// </summary>
			Single ParentHeight { get; }

			/// <summary>
			/// Актуальная высота (размер по Y) родительского элемента
			/// </summary>
			Single ParentHeightScreen { get; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка элемента в качестве дочернего
			/// </summary>
			/// <remarks>
			/// Реализация методов не должна предусматривать вызов их напрямую
			/// </remarks>
			/// <param name="child">Дочерний элемент></param>
			//---------------------------------------------------------------------------------------------------------
			void SetChildren(ILotusElement child);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Отмена установка элемента в качестве дочернего
			/// </summary>
			/// <remarks>
			/// Реализация методов не должна предусматривать вызов их напрямую
			/// </remarks>
			/// <param name="child">Дочерний элемент></param>
			//---------------------------------------------------------------------------------------------------------
			void UnsetChildren(ILotusElement child);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка родительского элемента
			/// </summary>
			/// <remarks>
			/// При абсолютной позиции элемент не меняет своего местоположения относительно экрана
			/// </remarks>
			/// <param name="parent">Родительский элемент</param>
			/// <param name="absolute_pos">Абсолютная позиция элемента</param>
			//---------------------------------------------------------------------------------------------------------
			void SetParent(ILotusElement parent, Boolean absolute_pos);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Получение области для размещения дочерних элементов
			/// </summary>
			/// <returns>Прямоугольник области для размещения дочерних элементов</returns>
			//---------------------------------------------------------------------------------------------------------
			Rect GetChildRectContent();
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================