//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DElementType.cs
*		Определение типов элементов пользовательского интерфейса.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup Unity2DCommonElement Подсистема элементов UI
		//! Подсистема элементов UI – формирует ряд базовых интерфейсов для унификации представления элементов UI, определяет
		//! общие структуры данных, классификацию и требуемые функциональные возможности для каждого типа элемента UI
		//! \ingroup Unity2DCommon
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Тип элемента пользовательского интерфейса
		/// </summary>
		/// <remarks>
		/// Здесь представлена общая концепция классификации элементов пользовательского интерфейса в зависимости их 
		/// назначения и функциональных возможностей. В основном используется для классификации элементов в 
		/// соответствующие группы
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TElementType
		{
			//
			// БАЗОВЫЕ ЭЛЕМЕНТЫ

			//
			// Базовые элементы интерфейса пользователя
			//
			#region ======================================= БАЗОВЫЕ ЭЛЕМЕНТЫ ==========================================
			/// <summary>
			/// Базовый элемент
			/// </summary>
			Element = 10,

			/// <summary>
			/// Элемент с базовым контентом
			/// </summary>
			/// <remarks>
			/// Как правило под базовым контентом понимается обычный текст и возможно дополнительно иконка изображения
			/// </remarks>
			Label = 20,

			/// <summary>
			/// Элемент с базовым контентом и с отдельным контентом значения
			/// </summary>
			LabelValue = 30,

			/// <summary>
			/// Элемент который может отображать данные различных типов
			/// </summary>
			LabelPresent = 40,
			#endregion

			//
			// Специальные элементы для отображения графического содержимого
			//
			#region ======================================= ЭЛЕМЕНТЫ ОТОБРАЖЕНИЯ ГРАФИКИ ==============================
			/// <summary>
			/// Элемент для отображения простого графического содержимого (текстура, спрайт)
			/// </summary>
			ImageBox = 100,

			/// <summary>
			/// Элемент для отображения анимированного графического содержимого (текстура, спрайт)
			/// </summary>
			ImageAnimationBox = 110,
			#endregion

			//
			// Элементы интерфейса пользователя с отдельной заголовочной областью
			//
			#region ======================================= ЗАГОЛОВОЧНЫЕ ЭЛЕМЕНТЫ =====================================
			/// <summary>
			/// Панель с базовым контентом и заголовком на отдельной заголовочной области
			/// </summary>
			PanelHeader = 200,

			/// <summary>
			/// Сворачиваемая панель
			/// </summary>
			PanelSpoiler = 210,
			#endregion

			//
			// Элементы интерфейса пользователя для индикации процессов или величины
			//
			#region ======================================= ЭЛЕМЕНТЫ ИНДИКАЦИИ ========================================
			/// <summary>
			/// Индикатор прогресса
			/// </summary>
			ProgressBar = 300,

			/// <summary>
			/// Индикатор рейтинга
			/// </summary>
			Raiting = 310,
			#endregion


			//
			// ОБЩИЕ УПРАВЛЯЮЩИЕ ЭЛЕМЕНТЫ
			//

			//
			// Стандартные управляющие элементы интерфейса пользователя
			//
			#region ======================================= СТАНДАРТНЫЕ ЭЛЕМЕНТЫ ======================================
			/// <summary>
			/// Кнопка
			/// </summary>
			Button = 1000,

			/// <summary>
			/// Переключатель
			/// </summary>
			CheckBox = 1010,

			/// <summary>
			/// Полоса прокрутки
			/// </summary>
			ScrollBar = 1020,

			/// <summary>
			/// Область просмотра
			/// </summary>
			ScrollView = 1030,

			/// <summary>
			/// Ползунок
			/// </summary>
			Slider = 1040,
			#endregion

			//
			// Управляющие элементы пользователя для редактирования и ввода данных
			//
			#region ======================================= ЭЛЕМЕНТЫ РЕДАКТИРОВАНИЯ ===================================
			/// <summary>
			/// Поле для ввода текстовых данных
			/// </summary>
			TextField = 1100,

			/// <summary>
			/// Счетчик - поле для ввода числовых данных
			/// </summary>
			Spinner = 1120,
			#endregion

			//
			// Элементы интерфейса пользователя со списком однотипных данных
			//
			#region ======================================= КОНТЕЙНЕРНЫЕ ЭЛЕМЕНТЫ =====================================
			/// <summary>
			/// Простой контейнер
			/// </summary>
			ContainerList = 1200,

			/// <summary>
			/// Список элементов которые могут находится в определенны состояниях
			/// </summary>
			Toolbar = 1220,

			/// <summary>
			/// Контейнер в виде выпадающего списка элементов
			/// </summary>
			DropDownList = 1240,

			/// <summary>
			/// Радиальное меню
			/// </summary>
			RadialMenu = 1260,

			/// <summary>
			/// Элемент представляющий список элементов с полями
			/// </summary>
			ListView = 1280,
			#endregion

			//
			// Элементы интерфейса пользователя представляющего собой окна
			//
			#region ======================================= ОКОННЫЕ ЭЛЕМЕНТЫ ==========================================
			/// <summary>
			/// Базовое окно
			/// </summary>
			WindowBase = 1300,

			/// <summary>
			/// Диалоговое окно
			/// </summary>
			WindowDialog = 1320,

			/// <summary>
			/// Диалоговое окно процесса
			/// </summary>
			WindowWaitProcess = 1340,
			#endregion

			//
			// Дополнительные управляющие элементы интерфейса пользователя
			//
			#region ======================================= ДОПОЛНИТЕЛЬНЫЕ ЭЛЕМЕНТЫ ===================================
			/// <summary>
			/// Джойстик
			/// </summary>
			Joystick = 1400,

			/// <summary>
			/// Набор вкладок
			/// </summary>
			TabControl = 1420,

			/// <summary>
			/// Сворачиваемый контейнер
			/// </summary>
			Accordion = 1440,

			/// <summary>
			/// Элемент предназначенный для отображения переписки
			/// </summary>
			Chat = 1460,
			#endregion

			//
			// РАСШИРЕННЫЕ УПРАВЛЯЮЩИЕ ЭЛЕМЕНТЫ
			//

			//
			// Элементы интерфейса пользователя с иерархическим (древовидным) отображением информации
			//
			#region ======================================= ИЕРАРХИЧЕСКИЕ ЭЛЕМЕНТЫ ====================================
			/// <summary>
			/// Элемент представляющий иерархический список элементов
			/// </summary>
			TreeView = 2000,

			/// <summary>
			/// Элемент представляющий иерархический список элементов с полями
			/// </summary>
			TreeListView = 2010,
			#endregion

			//
			// Плиточные элементы интерфейса пользователя с организацией размещения по сетки
			//
			#region ======================================= ТАЙЛОВЫЕ ЭЛЕМЕНТЫ =========================================
			/// <summary>
			/// Тайловый элемент(плитка)
			/// </summary>
			Tile = 2100,

			/// <summary>
			/// Тайловый элемент(плитка) с контентом
			/// </summary>
			TileContent = 2120,

			/// <summary>
			/// Сетка для расположения тайловых элементов
			/// </summary>
			GridTile = 2180,
			#endregion

			//
			// Специальные элементы интерфейса пользователя
			//
			#region ======================================= СПЕЦИАЛЬНЫЕ ЭЛЕМЕНТЫ ======================================
			/// <summary>
			/// Элемент для получения и управления цветом
			/// </summary>
			ColorPicker = 2200,

			/// <summary>
			/// Элемент для управления уровнем
			/// </summary>
			SelectorLevel = 2210
			#endregion

			//
			// Динамические элементы интерфейса пользователя
			//
			#region ======================================= ДИНАМИЧЕСКИЕ ЭЛЕМЕНТЫ =====================================
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================