//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DCommonStandard.cs
*		Определение структур данных и общих типов для стандартных управляющих элементов пользовательского интерфейса.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статус выбора элемента CheckBoxEx
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TCheckBoxState
		{
			/// <summary>
			/// Не активное состояние
			/// </summary>
			None,

			/// <summary>
			/// Выбранное состояние
			/// </summary>
			Selected,

			/// <summary>
			/// Неопределенное состояние
			/// </summary>
			Undefined
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Направления перемещения
		/// </summary>
		/// <remarks>
		/// Это не тоже что и свойства стандартного компонента.
		/// Данные свойства гарантированно перемещают контент по указанным направлениям.
		/// А стандартные свойства могут включатся и отключатся в зависимости от наличия фиксированного смещения
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TScrollDirection
		{
			/// <summary>
			/// Вертикальное перемещение
			/// </summary>
			Vertical,

			/// <summary>
			/// Горизонтальное перемещение
			/// </summary>
			Horizontal
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================