//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DCommonAdditional.cs
*		Определение структур данных и общих типов для дополнительных управляющих элементов пользовательского интерфейса.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим переключения вкладок
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public enum TTabItemSwitchMode
		{
			/// <summary>
			/// Простое переключение
			/// </summary>
			Swap,

			/// <summary>
			/// Путем движения
			/// </summary>
			Move,

			/// <summary>
			/// Путем вращения
			/// </summary>
			Rotation,

			/// <summary>
			/// Плавное затухание
			/// </summary>
			Fade
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================