//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема элементов UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DExtendedDynamic.cs
*		Определение структур данных и общих типов для динамических элементов пользовательского интерфейса.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonElement
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Параметр который может динамически меняться
		/// </summary>
		/// <remarks>
		/// Так как это флаги то их можно комбинировать
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		[Flags]
		public enum TDynamicParam
		{
			/// <summary>
			/// Позиция элемента
			/// </summary>
			Location = 1,

			/// <summary>
			/// Размер элемента
			/// </summary>
			Size = 2,

			/// <summary>
			/// Основной цвет (цвет текста)
			/// </summary>
			ColorText = 4,

			/// <summary>
			/// Размер шрифта
			/// </summary>
			FontSize = 8,

			/// <summary>
			/// Основной цвет (цвет текста)
			/// </summary>
			ColorBackground = 16,

			/// <summary>
			/// Анимация текстуры
			/// </summary>
			AnimationSprite = 32
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================