//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DBaseVisualEffect.cs
*		Определение типов данных и интерфейсов для реализации визуальных эффектов элемента.
*		Визуальные эффекты представляют собой различный эффекты, связанные со всем аспектами отображения элемента, 
*	включая его размер и местоположение.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для реализации визуального эффекта
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusVisualEffect
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Состояния для реагирования на действия пользователя
			/// </summary>
			TInteractiveState InteractiveState { get; }

			/// <summary>
			/// Продолжительность визуального эффекта, в секундах
			/// </summary>
			Single EffectDuration { get; }

			/// <summary>
			/// Статус активации визуального эффекта
			/// </summary>
			Boolean IsVisualActive { get; set; }
			#endregion

			#region ======================================= ОБЩИЕ МЕТОДЫ ==============================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установить оригинальное значение эффекта на основании текущего значения элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void SetOriginalValue();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Применение визуального эффекта активации элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void SetActivedEffect();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Применение визуального эффекта деактивации элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void SetDeactivedEffect();
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================