//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DBaseDragg.cs
*		Определение типов данных и интерфейсов для определения возможности перетаскивания элементов.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для перетаскиваемого элемента (или его структурной части)
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusDraggable
		{
			/// <summary>
			/// Статус перетаскивания элемента
			/// </summary>
			Boolean IsDragging { get; }

			/// <summary>
			/// Статус нажатия на перетаскиваемый элемент
			/// </summary>
			Boolean IsDownDragging { get; }

			/// <summary>
			/// Стартовая точки от которой началось перетаскивание
			/// </summary>
			/// <remarks>
			/// Позиция представлена в экранных координатах
			/// </remarks>
			Vector2 DragStartPositionScreen { get; }
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================