//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DBaseEnabling.cs
*		Определение типов данных и интерфейсов для определения доступности элемента.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для реализации доступности элемента
		/// </summary>
		/// <remarks>
		/// Под доступность понимается возможность взаимодействия пользователя с элементом
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusEnabling
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Включение/отключение доступности элемента
			/// </summary>
			Boolean IsEnabled { get; set; }

			/// <summary>
			/// Статус доступности элемента
			/// </summary>
			/// <remarks>
			/// Зависит как от статус самого элемента и так от статуса родительского элемента
			/// </remarks>
			Boolean IsEnabledElement { get; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка доступности элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void SetEnabledElement();
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================