//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Базовая подсистема
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGraphics2DBaseVisualStyle.cs
*		Определение интерфейса для реализации визуального стиля элемента.
*		Визуальный стиль элемента - набор предопределенных визуальных данных которые применяются к элементу или к его 
*	структурной части.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DCommonBase
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Определение интерфейса для реализации визуального стиля элемента
		/// </summary>
		/// <remarks>
		/// Визуальный стиль элемента - набор предопределенных визуальных данных которые применяются к элементу или
		/// к его структурной части
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusVisualStyle
		{
			#region ======================================= СВОЙСТВА ==================================================
			/// <summary>
			/// Индекс используемого базового визуального стиля из хранилища
			/// </summary>
			Int32 StyleMainIndex { get; set; }

			/// <summary>
			/// Имя используемого базового визуального стиля
			/// </summary>
			String StyleMainName { get; }

			/// <summary>
			/// Использование общего фонового изображения
			/// </summary>
			Boolean UseBackground { get; set; }
			#endregion

			#region ======================================= МЕТОДЫ ====================================================
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Обновление визуального стиля элемента
			/// </summary>
			//---------------------------------------------------------------------------------------------------------
			void UpdateVisualStyle();

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Копирование визуального стиля элемента с другого элемента
			/// </summary>
			/// <param name="source">Источник данных</param>
			//---------------------------------------------------------------------------------------------------------
			void CopyVisualStyle(ILotusVisualStyle source);
			#endregion
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================