//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль компонентов Unity UI
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusElementUISettings.cs
*		Настройки модуля компонентов Unity UI применительно к игровому режиму и редактору Unity.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//---------------------------------------------------------------------------------------------------------------------
// Обеспечивает дружественность для сборки редакторов
[assembly: InternalsVisibleToAttribute("Assembly-CSharp-Editor")]
[assembly: InternalsVisibleToAttribute("Lotus.Unity.Graphics2D.Editor")]
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DUI
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для опредления настроек модуля компонентов Unity UI применительно к игровому режиму и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XElementUIEditorSettings
		{
			/// <summary>
			/// Относительный путь директории исходного кода модуля компонентов Unity UI
			/// </summary>
			public const String SourcePath = XEditorSettings.SourceGraphics2DPath + "UI/";

			/// <summary>
			/// Путь в размещении меню редактора модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Graphics2D/UI/";

			//
			// ФУНКЦИОНАЛЬНЫЕ КОМПОНЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора функциональных компонентов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderFunc = XEditorSettings.MenuOrderGraphics2D + 150;

			/// <summary>
			/// Путь в размещении меню редактора функциональных компонентов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPathFunc = MenuPath + "Functional/";


			//
			// БАЗОВЫЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора базовых элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderBase = XEditorSettings.MenuOrderGraphics2D + 200;

			/// <summary>
			/// Путь в размещении меню редактора базовых элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPathBase = MenuPath + "BaseElements/";

			//
			// ОБЩИЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора общих элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderCommon = XEditorSettings.MenuOrderGraphics2D + 250;

			/// <summary>
			/// Путь в размещении меню редактора общих элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPathCommon = MenuPath + "CommonControls/";

			//
			// РАСШИРЕННЫЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора расширенных элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderExtended = XEditorSettings.MenuOrderGraphics2D + 300;

			/// <summary>
			/// Путь в размещении меню редактора расширенных элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPathExtended = MenuPath + "ExtendedControls/";

			//
			// ПРИМИТИВЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора расширенных элементов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderPrimitive = XEditorSettings.MenuOrderGraphics2D + 350;

			/// <summary>
			/// Путь в размещении меню редактора геометрических примитивов модуля компонентов Unity UI (для упорядочивания)
			/// </summary>
			public const String MenuPathPrimitive = MenuPath + "Primitive/";

			//
			// ПОСЛЕДНИЕ ПУНКТЫ МЕНЮ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора модуля компонентов Unity UI (для упорядочивания в конце)
			/// </summary>
			public const Int32 MenuOrderLast = XEditorSettings.MenuOrderGraphics2D + 400;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================