//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль работы со спрайтами
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusSpriteSettings.cs
*		Настройки модуля работы со спрайтами применительно к режиму разработки и редактору Unity
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Runtime.CompilerServices;
using System.Linq;
using System.Collections;
using System.Collections.Generic;
using System.IO;
using System.Xml;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//---------------------------------------------------------------------------------------------------------------------
// Обеспечивает дружественность для сборки редакторов
[assembly: InternalsVisibleToAttribute("Assembly-CSharp-Editor")]
[assembly: InternalsVisibleToAttribute("Lotus.Unity.Graphics2D.Editor")]
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DSprite
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения настроек модуля работы со спрайтами применительно к режиму разработки и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XSpriteEditorSettings
		{
			//
			// МОДУЛЬ СПРАЙТОВ
			//
			/// <summary>
			/// Относительный путь директории исходного кода модуля Sprite
			/// </summary>
			public const String SourcePath = XEditorSettings.SourceGraphics2DPath + "Sprite/";

			/// <summary>
			/// Путь в размещении меню редактора модуля спрайтов (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Graphics2D/Sprite/";

			//
			// БАЗОВЫЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора базовых элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderBase = XEditorSettings.MenuOrderGraphics2D + 550;

			/// <summary>
			/// Путь в размещении меню редактора базовых элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const String MenuPathBase = MenuPath + "BaseElements/";

			//
			// ОБЩИЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора общих элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderCommon = XEditorSettings.MenuOrderGraphics2D + 600;

			/// <summary>
			/// Путь в размещении меню редактора общих элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const String MenuPathCommon = MenuPath + "CommonControls/";

			//
			// РАСШИРЕННЫЕ ЭЛЕМЕНТЫ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора расширенных элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderExtended = XEditorSettings.MenuOrderGraphics2D + 650;

			/// <summary>
			/// Путь в размещении меню редактора расширенных элементов модуля спрайтов (для упорядочивания)
			/// </summary>
			public const String MenuPathExtended = MenuPath + "ExtendedControls/";

			//
			// ПОСЛЕДНИЕ ПУНКТЫ МЕНЮ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора модуля спрайтов (для упорядочивания в конце)
			/// </summary>
			public const Int32 MenuOrderLast = XEditorSettings.MenuOrderGraphics2D + 700;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================