//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Общий модуль 2D графики
// Подраздел: Подсистема игровых экранов
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusScreenGameCommon.cs
*		Основные типы и структуры данных подсистемы игровых экранов.
*		Подсистема игровых экранов представляет собой концепцию размещения взаимосвязанных игровых экранов между которыми
*	можно переключатся (добавлять), с поддержкой различного режима появления.
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Collections;
using System.ComponentModel;
using System.Xml;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \defgroup Unity2DCommonScreenGame Игровые экраны
		//! Подсистема игровых экранов представляет собой концепцию размещения взаимосвязанных игровых экранов между 
		//! которыми можно переключатся (добавлять), с поддержкой различного режима появления
		//! \ingroup Unity2DCommon
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Тип появления/скрытия игрового экрана
		/// </summary>
		/// <remarks>
		/// Тип появления/скрытия показывает как будет сменяться активный игровой экранов на другой
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TUIScreenGameViewType
		{
			/// <summary>
			/// Простое переключение
			/// </summary>
			Swap,

			/// <summary>
			/// Путем движения
			/// </summary>
			Move,

			/// <summary>
			/// Плавное затухание
			/// </summary>
			Fade
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Режим переключение игровых экранов
		/// </summary>
		/// <remarks>
		/// Режим переключения игровых экранов показывает что происходит с игровыми экранами
		/// </remarks>
		//-------------------------------------------------------------------------------------------------------------
		public enum TUIScreenGameModeBehavior
		{
			/// <summary>
			/// Один игровой экран сменился на другой
			/// </summary>
			Switch,

			/// <summary>
			/// Добавился игровой экран
			/// </summary>
			Add,

			/// <summary>
			/// Удалился игровой экран
			/// </summary>
			Remove
		}

		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Интерфейс для определения визуального элемента, который поддерживает концепцию игрового экрана и 
		/// непосредственно его отображает
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public interface ILotusScreenGameVisual
		{
			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка игрового экрана в указанную позицию
			/// </summary>
			/// <param name="position">Позиция в локальных координатах</param>
			//---------------------------------------------------------------------------------------------------------
			void SetScreenGamePosition(Vector2 position);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка видимости игрового экрана 
			/// </summary>
			/// <param name="visible">Видимость игрового экрана</param>
			//---------------------------------------------------------------------------------------------------------
			void SetScreenGameVisible(Boolean visible);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка прозрачности игрового экрана
			/// </summary>
			/// <param name="opacity">Прозрачность игрового экрана</param>
			//---------------------------------------------------------------------------------------------------------
			void SetScreenGameOpacity(Single opacity);

			//---------------------------------------------------------------------------------------------------------
			/// <summary>
			/// Установка смещения глубины показа(порядка рисования) игрового экрана
			/// </summary>
			/// <param name="depth_offset">Смещение по глубине</param>
			//---------------------------------------------------------------------------------------------------------
			void SetScreenGameDepthOffset(Int32 depth_offset);
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================