//=====================================================================================================================
// Проект: LotusPlatform
// Раздел: Модуль IMGUI Unity
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
//---------------------------------------------------------------------------------------------------------------------
/** \file LotusGUISettings.cs
*		Настройки модуля IMGUI Unity применительно к режиму разработки и редактору Unity
*/
//---------------------------------------------------------------------------------------------------------------------
// Версия: 1.0.0.0
// Последнее изменение от 27.03.2022
//=====================================================================================================================
using System;
using System.Linq;
using System.Collections;
using System.Collections.Generic;
using System.Runtime.CompilerServices;
using System.IO;
using System.Xml;
using UnityEngine;
//---------------------------------------------------------------------------------------------------------------------
using Lotus.Core;
//---------------------------------------------------------------------------------------------------------------------
// Обеспечивает дружественность для сборки редакторов
[assembly: InternalsVisibleToAttribute("Assembly-CSharp-Editor")]
[assembly: InternalsVisibleToAttribute("Lotus.Unity.Graphics2D.Editor")]
//=====================================================================================================================
namespace Lotus
{
	namespace Graphics2D
	{
		//-------------------------------------------------------------------------------------------------------------
		//! \addtogroup Unity2DImmedateGUI
		/*@{*/
		//-------------------------------------------------------------------------------------------------------------
		/// <summary>
		/// Статический класс для определения настроек модуля IMGUI Unity применительно к режиму разработки и редактору Unity
		/// </summary>
		//-------------------------------------------------------------------------------------------------------------
		public static class XGUIEditorSettings
		{
			/// <summary>
			/// Относительный путь директории исходного кода модуля IMGUI
			/// </summary>
			public const String SourcePath = XEditorSettings.SourceGraphics2DPath + "IMGUI/";

			/// <summary>
			/// Путь в размещении меню редактора модуля IMGUI (для упорядочивания)
			/// </summary>
			public const String MenuPath = XEditorSettings.MenuPlace + "Graphics2D/GUI/";

			//
			// КОМПОНЕНТНАЯ ОБОЛОЧКА
			//
			/// <summary>
			/// Последовательность в размещении меню редактора компонентной оболочки модуля IMGUI (для упорядочивания)
			/// </summary>
			public const Int32 MenuOrderComponent = XEditorSettings.MenuOrderGraphics2D + 450;

			/// <summary>
			/// Путь в размещении меню редактора компонентной оболочки модуля IMGUI (для упорядочивания)
			/// </summary>
			public const String MenuPathComponent = MenuPath + "Components/";

			//
			// ПОСЛЕДНИЕ ПУНКТЫ МЕНЮ
			//
			/// <summary>
			/// Последовательность в размещении меню редактора модуля IMGUI (для упорядочивания в конце)
			/// </summary>
			public const Int32 MenuOrderLast = XEditorSettings.MenuOrderGraphics2D + 500;
		}
		//-------------------------------------------------------------------------------------------------------------
		/*@}*/
		//-------------------------------------------------------------------------------------------------------------
	}
}
//=====================================================================================================================