//---------------------------------------------------------------------------------------------------------------------
// Проект: LotusPlatform
// Автор: MagistrBYTE aka DanielDem <dementevds@gmail.com>
// Описание: Системный шейдер для рисования примитивов простым цветом с учетом прозрачности.
// Версия: 1.0.0.0
//---------------------------------------------------------------------------------------------------------------------
Shader "Lotus/Render2D/Color Blend"
{
	SubShader
	{
		Pass
		{
			Blend SrcAlpha OneMinusSrcAlpha
			ZWrite Off 
			Cull Off
			Fog { Mode Off }

			BindChannels
			{
				Bind "vertex", vertex 
				Bind "color", color 
			}
		}
	}

	Fallback "Default"
}
//---------------------------------------------------------------------------------------------------------------------